{"Blog-Posts/devlog-1":{"title":"LibLog 1","links":["github.com/jghauser/papis.nvim"],"tags":["Liblog","Papis","Neovim","Zettelkasten"],"content":"I have decided that I will be doing a sort of dev log for librarians. I would not be so bold as to call myself a developer per se, but I would call myself at least a dabbler in programming for the web and some applications.\nImplementing new Functionality in Papis.Nvim\npapis.nvim is a super neat neovim plugin that allows you to browse, edit, and insert your papis library into your academic articles. I do think Zotero is super great for people who are less neurotic, but since I prefer to live within the terminal, papis is a great choice for me. When I write, I tend to write the article as I read papers. I have never been a good note taker (although I am trying out some zettelkasten neovim plugins like vim-wiki), and so being able to quickly add articles to my library as I write is a great feature for me.\nI am using the form functionality in the neovim API to catch a DOI or other link and escape to a shell process for creating the record in the papis database. This is essentially a wrapper around the papis CLI that allows for interaction with the CLI from within neovim using neovim commands. I am hoping to get this functionality merged and have test coverage over the next couple of months.\nBuilding a small Flask App for Zettelkasten\nI have been working on zktn, a small flask app that creates a graph view of any directory containing one or more markdown documents. It uses the pyviz library and networkx to create a web server where the user can view and interact with nodes (notes) and edges of the graph. I have yet to test it at a very large scale, as I do not have that many notes. There are certainly optimizations and features that can be added to the tool, but now it is functional by just using python ./ztkn/src.py /path/to/notes.\nI use neovim to take notes, write academic articles, and do data science. My entire workflow is in neovim. I have tried a lot of zettelkasten neovim plugins, but I have always found that the way I find most ergonomic for me is to simply touch note.md and start writing. Luckily, LazyVim’s “lang.markdown” plugin helps in making creating the actual links between documents ergonomic, allowing me to simply use the note syntax and then use ztkn to build a graph.\nAccelerating Digital Humanities Research with CUDA on Northwestern’s Supercomputer\nMy home university, Northwestern, has an amazing supercomputer resource that I am lucky enough to be able to access for free as faculty. However, as upgrading enterprise infrastructure is a pain in the ass, we are running out of date versions of CUDA and libc. I am currently using BERTopic to run topic modelling and similarity analysis on hundreds of thousands of academic articles, newspapers, visual arts, and novels to understand how the language of the anthropocene propogates through different media types and within different people who use the same medium of communication.\nUsing BERTopic with CUDA was quite a pain. Actually, more specifically, using conda on a supercomputer is a pain. Depending on the order that you would install packages, different versions would be installed and some modules of PyTorch would outright not be found. Luckily, on Northwestern’s HPC, we can use Torch 2.0 to be compatible with the relatively outdated glib version that Quest is running.\nAfter topic modelling, I am using networkx to analyze inter-topic interactions and influence, for example, answering the question “Do newspapers about climate change influence scientists to study the climate?” Or vice versa. BERTopic generated thousands of topics with the very large corpus I fed it, and so creating a network of all of these nodes and calculating the cosine similarity between these nodes took hours of embedding documents, creating a graph, and then calculating the cosine similarity between nodes. Using the RAPIDSAI library, specifically the cuGraph module, I was able to speed up the networkx backend by several times, allowing me to decrease our time-to-insight, debug, and find new results or ideas faster.\nSome other thoughts\nI have been wanting to create more resources for neovim. Many of my friends love VSCode, for good reason too. A slick looking UI, great remote development features, and a huge ecosystem of plugins justifies its’ market dominance in programmers. The tools above, especially new functionality papis.nvim and the ztkn application, will hopefully ease the transition into neovim, and allow for easy integration with other tools.\nBe on the lookout on my next post to talk about how I am using LLMs to generate metadata to decrease author burden and increase the publishing efficiency of libraries by using GPT-3.5 to convert plaintext citations into a biblatex format."},"Blog-Posts/devlog-2":{"title":"LibLog 2","links":[],"tags":["Liblog","Typst","Latex","Hugo","Digital-Publishing"],"content":"It has been a while since I have written on this blog. It has been a very busy fall-winter season here at Northwestern. In the months since I last wrote on this blog, I read Anti-Oculus: A Philosophy of Escape by Acid Horizon and Science and Poetry by Mary Midgley. I have also developed and released the Northwestern University Studies in Russian Philosophy, Literature, and Religious Thought(NURPLRT), released a new web-version issue of the Bulletin of Applied Transgender Studies (BATS), got interviewed by The Daily Northwestern, and have re-started work on my Anthropocene project.\nI will, at some point, write not quite a review, but retrospectives, of both Science and Poetry and Anti-Oculus, but this will focus on the development of the NU Studies in Russian Philosophy, Literature, and Religious Thought. This project was the brainchild of the directors of the NU Research Initiative in Philosophy, Literature, and Religious Thought. They came to me with a problem---they wanted a journal, but they could not pay much money for one. Brad Underwood---the associate director of the initiative---had been in contact with many other research organizations on campus, only to find out that they had managed solutions that ran in the tens of thousands of dollars.\nFuck that.\nBuilding this Project\nWe started with lifting much of my predecessor’s hugo code written for BATS, making tweaks and adjustments to the styling. Then our Media and Design Studio got involved and made a beautiful template that really made it stand out.\nThen came the typesetting. Now, I have written my fair share of LaTeX code before. But the design that was being asked for was a whole new ballgame. I agreed that I would write some very complex LaTeX code to get it done. Eventually, after dozens of revisions and edits, we had a finished product.\nTypst\nTypst is a relatively new markup language that markets itself as the successor to LaTeX. While it is definitely easier to use automation and logic scripts to programmatically generate a PDF than LaTeX, it is still in its adolescence, and as someone who is perpetually and professionally worried about sustainability and reproducibility, such a young markup language makes me nervous in several ways.\nBut, alas, it took me weeks to build a document that looked good in LaTeX (even having some LaTeX experience), but building it in Typst took about 10 hours of hard work grinding through documentation. Drawing boxes and creating environments was easy enough, and I didn’t have to worry as much about font environments and “smart” markup as I did in LaTeX. My one complaint is that editing outline entries is unintuitive and has sparse documentation. There is, of course, specific documentation about styling your outlines, but not outright changing them.\nFor example, we have an article titled “Momentous Intersections: A Comparative View on Russian and Jewish Spiritual Traditions”, it is a splendid article, and a good read. My approach to designing the title, subtitle and author lines within the article were to use the #heading function in Typst for the title, and then create a custom subtitle and author function, respectively.\n#show outline.entry.where(\n  level: 2,\n  body: [Momentous Intersections]\n): it =&gt; {\n  v(1em)\n  set par(leading: .5em)\n  set text(font: &quot;IBM Plex Sans&quot;, size: 12pt, stretch: 75%, weight: 500)\n  link(it.element.location(), box(width: 100%)[\n    Momentous Intersections: \\\n    A Comparative View on Russian and Jewish\n    Spiritual Traditions\n    #set text(font: &quot;IBM Plex Sans&quot;, stretch: 75%, size: 10pt, weight: 300)\n    \\ _by_ \n    #set text(font: &quot;IBM Plex Sans&quot;, stretch: 75%, size: 12pt, weight: 300)\n    Mikhail Epstein\n    #box(width: 1fr, repeat([.]))\n    #it.page\n  ])\n}\nI think that this is a rather unintuitive solution, I think that it would be better to introduce an argument to the heading function that would allow for customization of the content that goes into the outline.\nSomething like:\n#heading(level: 2,\n        outline: true, \n        outlineentry: [Momentous Intersections: \\\n                      A Comparative View on Russian and Jewish Spiritual Traditions\\\n                      _by_ Mikhail Epstein])[Momentous Intersections]\nThis would prevent some of the headache.\nGiven all these issues though, Typst, in my use-case, seems to be the better option. Perhaps I am just not used to the programming paradigms of LaTeX, or I somehow prefer the very elegant error messages and synctex-like compilers that allow for immediate view of the document being created.\nI had been using some packages that prevented me from using a lot of synctex features, along with tectonic typesetting. This, along with very long compile times, and vimtex taking up a ton of memory, gives me the motivation I need to take the risk with Typst. The GitHub community seems to be active and the maintainers have yet to do anything super shady, so I will be using this for the time being.\nIf anyone is actually reading this, I would, though, like to have an “insert PDF” into my Typst so I can input a cover to my document easily."},"Blog-Posts/index":{"title":"Blog Posts","links":["Blog-Posts/devlog-1"],"tags":["Liblog"],"content":"Blog posts are longer-form, fleshed-out ideas and essays that may or may reference others. These are usually titled liblogs to reference my obsession with libraries of all kinds.\nHere is an entry point to devlog-1.md"},"Reading-Notes/The-Long-Revolution/Part-1/The-Creative-Mind/the-creative-mind":{"title":"The Creative Mind","links":[],"tags":["Renaissance-Thought","Creativity","The-Long-Revolution","The-Long-Revolution-Part-1","The-Creative-Mind"],"content":"The Creative Mind is the first section of the first part of The Long Revolution."},"Reading-Notes/The-Long-Revolution/Part-1/the-long-revolution-part-1":{"title":"The Long Revolution Part I","links":[],"tags":["Renaissance-Thought","Cultural-Theory","Raymond-Williams","Creativity","The-Creative-Mind","The-Long-Revolution","The-Long-Revolution-Part-1"],"content":"Part 1 of The Long Revolution gives groundwork for the analysis of future parts of the book."},"Reading-Notes/The-Long-Revolution/the-long-revolution":{"title":"The Long Revolution","links":[],"tags":["Cultural-Theory","Creativity","Raymond-Williams","The-Long-Revolution"],"content":"The Long Revolution is a book by Raymond Williams that seeks to analyze the perpetual revolutions in which we tend to find ourselves in modernity.\nPart I"},"Reading-Notes/crowds-power":{"title":"Crowds and Power","links":[],"tags":["Crowds-and-Power","Elias-Canetti","H.P.-Lovecraft","The-Unknown"],"content":"Crowds and Power by Elias Canetti is concerned about crowds. How they form, what they do, and how they operate.\nThe opening to the book is very haunting, yet also illuminating. It highlights the anger, the hate, the violence with which one is filled when moving through a crowd.\n\nMan petrifies and darkens in the distances he has created.\n\nThe discharge is the moment when all inhibitions are lost and a crowd truly becomes that of a hive-mind. Something that is inseparable but also of distinct individuals."},"book-review/ccru":{"title":"Is Fiction Going to Kill Us?","links":["µkrite/death-instinct"],"tags":[],"content":"This article spoils War Games (1983).\nI recently finished CCRU Writings, 1997-2003, and came away with many conflicting, confusing, and conspiratorial thoughts.\nThese writings blend storytelling and critical theory. It exists in the sludge between fiction and fact. Worryingly, unlike sci-fi dystopias like 1984 — as much as people like to think we are constantly living in “literally 1984” — the fiction presented in these pages seem to beg the reader to compare to their modern time.\nHyperreality\nWe are unable to take stock of the interaction between fiction and reality without turning to Baudrillard. As a point of review, Simulacra and Simulation discusses the extent to which humans confuse symbols that represent reality and reality itself.\nConfusing the Real and the Fictive\nAxsys as a Symbol - Palantir as Reality\nAxSys, an artificial intelligence discussed at length in the CCRU Collected Writings is, from the glossary:\n\nFirst true AI. Prophecied-programmed as a self-enhancing system of photonic metacomputing, it emerges as the organo-transcendent completion of Oecumenon, or techonomic realization of the noosphere. According to AOE [Architectonic Order of the Eschaton] traditions, if there was a God it would be Axsys.\n\nNow we must define terms in the definition.1 First term of order that is idiosyncratic to the CCRU universe, “Oecumenon,” which is the “security architecture supporting the megasocious of terrestrial capitalism.” Oecumenon is derived from the greek word oikoumenikós, meaning “for the whole world.”\nThus, Axsys is an artificial intelligence that works as the completion of the security architecture that supports global capitalism.\nThese names, are made to sound fictive. They evoke a sense of false safety in the reader with their ridiculousness. Axsys, to me, sounds like the name of an electronic-industrial music group from the early 2010s. Yet, fact is more ridiculous than fiction. We in fact are on our way to building an Axsys machine; we may even be closer than most of us realize. There are two companies that are currently gaining lots of momentum both on Wall Street and in the Pentagon: Palantir and Anduril. Besides the absolute fucking ridiculousness of having secretive companies that run classified operations for the U.S. military named after items from the god-damned Lord of the Rings, we must realize that these companies are driving surveillance and operations solutions for military, police, and private security. These companies are attempting to build an Axsys. Something that can predict your thoughts, movements, and actions; and move against you if necessary.\nThe Merging of Fiction and Reality\nIt is not difficult to observe how products like Palantir’s “Gotham” and Anduril’s “Lattice” are real-world entities that fit the archetype that is given by Axsys. CCRU is not the only fiction that has given us the framework to understand the world. When the real and the symbols that represent the real fails to be separated, we enter the realm of hyperreality.\nIn the west, proto-AI conceptualizations come down to us from the Greeks. Let us look to the giant Talos from Greek mythology. He was a giant of metal who was described as an “automaton.” Talos served a military purpose, guarding the island of Crete, and was defeated by trickery and intelligence — not through might — by Jason and the Argonauts. This symbol has reverberated throughout western media. In 1983’s War Games, WOPR — the AI gone-rouge — is defeated not through the sheer might of the United States military, but through cunning by the main character and his compatriots.\nThe west has been obsessed with creating artificial life for millennia, are we really so surprised that AI would emerge from myth and into reality?\nHypereschatologies\nOften, we create our own demons. Our ancient stories of “Revelations of the End Times” still hold vice grips on more gullible populations. Our demons used to serve as moral plays teaching us not to mess without forces we cannot understand, to not question the will of nature, that type of thing.2 With the emergence of technocapitalism, our demons --- our symbols --- are used to sell shitty products!\nIs the AI Bubble Going to Burst? Or is AI too entrenched a symbol?\nLike the metaverse before it, AI and other entrenched symbols often stumble on in the cultural zeitgeist. The shambling, capital-extracted corpse of a once-meaningful symbol for a cultural moment, an intrinsically human experience, lives on in trillion-dollar valuations by Standard and Poor.\nWhen investors realize that we invested in AI not for an economic purpose, (investment certainly will not align with economic return in any meaningful way) but rather because of what AI represents to the cultural techostructure, the AI bubble will collapse. The dotcom bubble occurred because of the cultural symbol of an interlinked society would mean, and investment was not rational.3 I have a sneaking suspicion that, while AI will produce massive economic value for the world, it will inevitably fail to live up to expectations, and many companies will die up and down the supply chain.\nTo Answer the Title Question\nThe symbols that we use to mold our perceptions of reality from entrench themselves into our minds. We must protect ourselves from the psychic invasion from the past. There is a time-traveling element to our symbols. They emerge from our past to make us fear for our future. A future where we are soft-squishy things that have no mouth and must scream, a future war with rogue AI in computer simulations. The ancient symbols of AI were just that, artificial humans, with no real stakes beyond the Greek world. We have made it to the point where we have brought forth this symbol into reality. It has become hyperreal. Our fictions merged with the fact.\nIf we get an idea from a storyteller, and engineer that idea into a product, and that product destroys our world, has that fiction destroyed us?\nFootnotes\n\n\nIf you want to be good at philosophy, just be prepared to recursively define terms. ↩\n\n\nBut of course you can buy your way out of the revelations for only 24 payments of $699.99! ↩\n\n\nI have to use my MBA somehow so fuck you here is a post-structural economic analysis of artificial intelligence. Where is your god now? ↩\n\n\n"},"book-review/the-weird-and-the-eerie":{"title":"The Weird and the Eerie","links":[],"tags":[],"content":"The name Mark Fisher was first mentioned to me by an acquaintance and fellow philosophy student at when I was an undergraduate. I failed to understand Capitalist Realism the first time around. Simply because I did not have the life experience necessary to appreciate it. The argument didn’t really click in my mind, until I went home for Christmas, endured the usual spectacle of political debate at the family reunion, and realized how resigned people are to our current political-economic system. This experience with Fisher’s work was the beginning of my long relationship with his work. His blog k-punk was the impetus for the formulation of my own pseudonymous online identity. The seriousness with which he took every subject is admirable, even aspirational. Although I do not share all the literary, musical, or cinemagraphic tastes, a deep, critical examination of the culture I embed myself with is necessary to me. It allows for a reflective value-determination of what you engage with, and orients oneself to more productive, fulfilling works of art, science, and culture.\nThis diversion from typical Mark Fisher “professional book” topics of discussion provides all the more reason to love The Weird and the Eerie. It is a celebration of the mode of thought that I am most accustomed to — weird, strange, uncanny. It serves as a list of film, musical, literary, and visual arts — a list that one can return to as a reminder that they are not the first to confront the Lacanian collapse of the symbolic order.\nMark Fisher is talented at making difficult theoretical positions clear to the lay audience. I do not claim to have absolute knowledge, but I probably have read more culture theory than the average person. After fighting dense treatises by Williams or Althusser, it is refreshing to be able to pick something up and understand it instantly. If you have ever had a passing interest in science fiction, horror novels, or the Lovecraftian Cthulu-mythos, this is likely a relatively easy read. His analysis of the “weird” is situated much more in terms of horror — specifically weird horror — than Fisher’s conception of the “eerie.” Much of this definition of the “weird” is about transgressing, about moving between, inside, and outside worlds. Fisher gives the example of the Color out of time (emphasis) mind a prime example of invasions from outside our natural world. Though this concept is may best be presented in Robert W. Chambers’ work The King in Yellow, where there is greater emphasis in the  “fighting-agianst” the weird, attempting to downplay, deny, or ignore any of the extra-natural invasions into the natural.\nThus, we must make our wrenching turn into how this book, in some “weird” way, is itself an expression of the very artistic mode that he describes. This book was published mere weeks before Fisher died, making this book a difficult read with that hindsight. The book does not deal explicitly with depression or difficult lost futures as Ghosts of My Life does. The Weird and the Eerie instead reads as an expression of a man’s love for art, music, literature, and philosophy. As in all of Fisher’s works, it is utterly sincere, disinterested in if or how people may think of it as “kitschy” (in the same way that Fisher discusses Nolan’s Interstellar). The book does not necessarily make any groundbreaking points, in fact, it rarely really makes any new points at all beyond the first 45 pages. However, it is ready to burst with insightful literary analysis, a new hermeneutic with which to re-watch Tarkovsky’s Solaris, re-read Philip K. Dick, or to re-engage with Magritte.\nThis book is not a particularly emotional book. It does not dwell in depression or grieve the awaited futures that are promised in advertisements. But the expression of loneliness in this book is profound. There is a hollowness in this text, that is only punctuated by only the occasional agent provocateur that is so common in Fisher’s texts. I happened to read the section on Brian Eno — specifically the opening paragraphs where Mark Fisher offers a glimpse into a “real” experience he had while taking a walk with a friend and seeing a port — while on a the Union-Pacific Northwest Metra train out of downtown Chicago.\nIf you have ever been in the South and West loop areas of Chicago, you are familiar with the strange interplay of heavy iron trains surrounding the sleek glass of emerging tech companies. If you happened to also have lived in the Loop, as I have, you know that it is empty on the weekends, relatively speaking. Walking in to the Ogilvie train station from the empty sidewalks of Madison Street in the middle of the day, surrounded by buildings designed to fill thousands, yet holding none. Moving from the grimy perpetually-under-construction streets of downtown to the cold unfeeling panopticon of the Accenture tower, to the sudden thrust into the dark, damp, hole from which the trains move in and out in some horrific phallic cacophony of screeching metal. The gray, cold air clung to my almost-empty train cars as we lurched along creaking tracks as if we were a mammoth creature beginning to move. I felt the oppressive effects of the urban planning into which I have been thrust. I read:\n\nThe port and the burial ground offer two different versions of the eerie. The container port looms over the declining sea-side town, the port’s cranes towering above the Victorian resort like H.G. Wells’s Martian Tripods. Approached from the countryside, from Trimley marshes, the cranes preside over the rural scene like gleaming cybernetic dinosaurs erupting out of a Constable landscape. Viewed in this way, the port appears almost as a weird phenomenon, an alien and incommensurable eruption in the “natural” scene. Ultimately, however, it is the feeling of the eerie that is dominant. There’s an eerie sense of silence about the port that has nothing to do with actual noise levels. The port is full of the inorganic clangs and clanks that issue from ships as they are loaded and unloaded; what’s missing, at least for the spectator watching the port from a vantage point outside, are any traces of language and sociability. Watching the container lorries and the ships do their work, or surveying the containers themselves, the meta boxes racked up like a materialised version of the bar charts in Gibson’s cybeerspace, their names ringing with a certain transnational, blank, Ballardian poetry — Maersk Sealand, Hanlin, K-line — one seldom has any sense of human presence. The humans remain out of sight, in cabs, in cranes, in offices. I’m reminded instead of the mute alien efficiency of the pod distribution site in Philip Kaufman’s 1978 version of Invasion of the Body Snatchers. The contrast between the container port, in which humans are invisible connectors between automated systems, and the clamour of the old Longdon docks, which the port of Felextowe effectively replaced, tells us a great deal about the shifts of capital and labour in the last forty years. The port is a sign of the triumph of finance capital; it is part of the heavy material infrastructure the facilitates the illusion of a “dematerialised” capitalism. It is the eerie underside of contemporary capital’s mundane gloss.\nGhosts of My Life pp. 76-77. Repeater Books. 2016.\n\nAnd thus, my symbolic order collapsed. And I cried in public over some architecture."},"education":{"title":"Education","links":[],"tags":["Resume","Education"],"content":"Master of Business Administration\nLoyola University Chicago, 2022-2024\nMaster of Science - Information Systems and Analytics\nLoyola University Chicago, 2022-2024\nMaster of Library and Information Sciences\nDominican University 2021-2022\nBachelor of Arts - Philosophy\nDePaul University - 2018-2021"},"experience":{"title":"Experience","links":[],"tags":["Resume","Work"],"content":"Digital Publishing and Repository Librarian\nNorthwestern University Libraries, September 2023 - Present\n\nPublishes journals by Northwestern University and affiliated faculty.\nWorking on Anthropocene Project\n\nData Science Consultant\nCapgemini Invent, February 2022 - August 2023\n\nProvided data management expertise to retail company\nBuilt data-driven research platform using RAG LLMs.\n"},"holocene":{"title":"The Holocene","links":[],"tags":[],"content":"Holocene meaning “Recent Whole”\n\nPost-glacial geological epoch of past 10-12 thousand years. 1\n\nFootnotes\n\n\nQuoted from the “Anthropocene” by Paul Crutzen and Eugene F. Stoermer LINK ↩\n\n\n"},"index":{"title":"Welcome to my KyberGarden","links":[],"tags":[],"content":"Welcome to Aerith’s KyberGarden\nI am Aerith Netzer, the Digital Publishing and Repository Librarian in the Digital Scholarship workgroup @ Northwestern University Libraries.\nExperience\nDigital Publishing and Repository Librarian\nNorthwestern University Libraries\nSeptember 2023—Present\n\nDeveloping and maintaining Studies in Russian Philosophy, Literature, and Religious Thought\nDeveloping and maintaining the web version of the Bulletin of Applied Trans Studies\nDeveloping text-analysis workflows on supercomputers for the humanities as part of a grant from the Mellon Foundation\nDeveloping journal management system\nDevelop and maintain Open Education Resources\n\nTechnical Skills\n\nPython: Advanced\nParticulary:\n\nBERTopic\nNLTK\nPyTorch (for text analysis)\nNetworkx\n\n\nSLURM: Advanced\nJavascript: Moderate\nHugo (Static Site Generator): Advanced\nGit: Advanced\nAWS: Moderate (AWS Amplify Deployments)\nAzure: Moderate (OpenAI Deployments)\nLaTeX: Advanced\nTypst: Moderate\nNginx: Beginner\n\nEducation\nMaster of Business Administration\nLoyola University Chicago\nConferred 2024\nMaster of Science --- Information Systems\nLoyola University Chicago\nConferred 2024\nMaster of Library and Information Science\nDominican University\nConferred 2022\nBachelor of Arts in Philosophy\nDePaul University\nConferred 2021\nPress\n\nQuotes in The Daily Northwestern\n"},"µkrite/death-instinct":{"title":"<i> Nu Nu Meta Phenomena</i> - Death Drives of the Ego and the Self","links":[],"tags":[],"content":"\nArt courtesy of Machine Girl’s Bandcamp\nMy Apologia\nThis blog, music review thing, notebook, etc. was born partially from me growing tired of the stupid shit that people say online. There is no substance, no conversation to be had. Just shitty one-liners to accrue internet clout. This blog, to which I clearly owe much of my intellectual development to scholars and blogs such as Mark Fisher’s k-punk, is an attempt to force me to think things through, to engage with things critically, and I hope, to be a better writer.\nAlso whoever at Pitchfork wrote that review of MG Ultra please do something more useful with your life. Generating AI slop is better than whatever that review was.\nMachine Girl’s 2024 album MG Ultra tells un-narratives with schizophrenic storytellers - Vignettes of the drug-induced mania (Sick!!!), the thought that everyone hates you (Psychic Attack), and nihiic views of human indulgence (Hot Lizard) invade the ener. Like previous MG work, it captures and reduces a feeling of jouissance into aural creations that attack your sense of self. This is an album about the loss of self, about ego death, about paranoia, about suffering, about drug abuse and the confusion of fiction and fact.\noh god oh fuck we’re gonna do death of the author\nJouissance, The Death Drive, and The Insatiable Lust for Violence in All of Us\nThe hectic and bass-driven sound on the track “Grindhouse” seems intentionally designed to get eners ready to violently fuck, and that is even before you listen to the lyrics.\n\nFuck a safe word \nGive it to me extra rough\n\nThe very song evokes imagery of an old Grindhouse or exploitation films, ergo the name. The narrator assuming the role of a submissive in a hardcore BDSM relationship begins to become ever more depraved, beginning to beg for pain as their only source of pleasure. In the last verse:\n\nTill you puke up blood \nThat’s the stuff we love \nWe can’t get enough \nWatch me lick it up \nLike a good little sub \nIn the grindhouse\n\nHere the narrator has gone truly beyond the pleasure principle. It is no coincidence that in this psychoanalytic vignettes, that in going beyond the pleasure principle, we have engaged with flows and breaks in those flows (See Capitalisme et Schizoprenie). This is the story of a person who embodies the anti-Oedipus. This is not behavior that is easily explained by simple pleasure principle or oral fixation. This is a mind who is so engrossed Let us look to Tamsin E. Lorraine’s 2003 work on Schizoanalysis.\n\nOn the body without organs, desire is the only subject. It passes from one body to another, producing partial objects, creating breaks and flows, ‘following connections and appropriations that each time destroy the factitious unity of a possessive or proprietary ego’ (AO, 72).\n\nDesire, clearly, is the only subject in this sequence of events that Machine Girl brings us. Desire has taken over this person’s mind completely, they are unable or unwilling to put a stop to such pleasure, even in the event of grievous bodily injury. The person qua person is a completely detached entity, a pure object, that only receives instruction and action upon itself. The interaction between the dominator and the dominator have become competing and co-operative desiring-machines. They have no personhood, no sense of ego or superego, only an id that has made one of its’ sparse appearances to the surface of a human psyche.\nThe person has been destroyed, and only desire remains.\nThe Unbearable Pain of Overwhelming Hatred\nSchizodipshit, the penultimate track on the album, is an anthem of the bipolar. Between manic exaltations threatening violence, extolling the frivolity of humanity, and narcissistic outbursts, there are 4 lines where the vocals are pitched heavily down:\n\nI’m so full of shit\n…\nI’m ready to kill\n…\nDon’t be afraid\n…\nNo one fools me\n\nHave you ever felt the overwhelming urge to kill someone?\nHave you ever wanted to destroy as much as possible on your way to hell?\nHave you ever wanted to be a terrorist?\nAre you bored? Do you feel like you need to let loose? Are you dissatisfied?\nDo you want those who control you to fall victim to the torture they put you through?\nDo you feel these feelings so much they cause you pain?\nDo your feelings cause you pain?\nDo you want to die in pain?\nDo you want to live in pain?\nThen, as MG so eloquently states:\n\nOpen your mind \nDon’t be afraid\n…\nKiller fanatic \n…\nFirst person shooter\n…\nAll the chaos and confusion\n…\nNow I’m locked and loaded \nBut caught off guard\n\nWe see here that MG has become self-critical, they are caught off-guard by their actions. Their mind has cracked from their schizophrenic neuroses. They have a moment of reflection, a becoming-whole again. As MG states:\n\nMy head splits open \nAnd now the thoughts are gone\n\nThe word “Schizophrenia” literally means “splitting of the mind.” In moments, one could be viewed an asymptomatic schizophrenic, and in the next, one could be “fall[ing] into a hole.” There is no exact moment of splitting, it is a gradual change between these two states that are driven by the pleasure drive and the death drive. When one becomes so entwined with the pleasure drive that the only way to feel pleasure is through pain, or when one thirsts for annihilation in such a way that this virulent nihilism subsumes them, the outcome is anti-social behaviors.\nTell me, if someone tortured you, put your life through hell, split your mind in twain, and made you fear for your sanity, your life, and family, wouldn’t you be glad to see them put down like sickly cattle on a farm? Does that make you insane? Does that drive you mad?\n\nThis war is a psycho \nWhere madness is priceless\n\nLiving in the Sludge Between Phenomena and Noumena\nA common motif throughout MG’s discography is seeking to understand if capital-T Truth exists. Does a world exist beyond our perception? If we return to the common refrain from …Because I’m Young Arrogant and Hate Everything You Stand For, we see a phrase that embodies a common theme in MG’s music - “I exist in the sludge between fiction and fact.” In doing so, MG defines themselves as existing not really in the Real but also not really as a character. Here, we take a lesson from Baudrillard. MG exist in the hyperreal. Machine Girl is a signifier, a simulacra of the nihilism that pervades our culture.\nMG generates a model of virulent nihilism, without origin or reality. They are characters that attempt (and in my opinion, succeed), at representing the condition of so-called “misfits” and showcase deepest desires, their depraved wants, their thirst for annihilation. MG represents a way to escape and to feel that annihilation, that lust, that bloodthirstiness. But at a safe distance.\nWe exist in between the real and the hyperreal. We create fictions for ourselves because the world is too much to bear. We consume these fictions like Machine Girl because if we didn’t we would fall into a hole, kill others, and then ourselves."}}