{"The-Long-Revolution/Part-1/The-Creative-Mind/the-creative-mind":{"title":"The Creative Mind","links":[],"tags":["Renaissance-Thought","Creativity","The-Long-Revolution","The-Long-Revolution-Part-1","The-Creative-Mind"],"content":"The Creative Mind is the first section of the first part of The Long Revolution."},"The-Long-Revolution/Part-1/the-long-revolution-part-1":{"title":"The Long Revolution Part I","links":[],"tags":["Renaissance-Thought","Cultural-Theory","Raymond-Williams","Creativity","The-Creative-Mind","The-Long-Revolution","The-Long-Revolution-Part-1"],"content":"Part 1 of The Long Revolution gives groundwork for the analysis of future parts of the book."},"The-Long-Revolution/the-long-revolution":{"title":"The Long Revolution","links":[],"tags":["Cultural-Theory","Creativity","Raymond-Williams","The-Long-Revolution"],"content":"The Long Revolution is a book by Raymond Williams that seeks to analyze the perpetual revolutions in which we tend to find ourselves in modernity.\nPart I"},"anthropocene":{"title":"The Anthropocene","links":["holocene"],"tags":[],"content":"The holocene.md"},"devlog-1":{"title":"LibLog 1","links":["github.com/jghauser/papis.nvim"],"tags":["Liblog","Papis","Neovim","Zettelkasten"],"content":"I have decided that I will be doing a sort of dev log for librarians. I would not be so bold as to call myself a developer per se, but I would call myself at least a dabbler in programming for the web and some applications.\nImplementing new Functionality in Papis.Nvim\npapis.nvim is a super neat neovim plugin that allows you to browse, edit, and insert your papis library into your academic articles. I do think Zotero is super great for people who are less neurotic, but since I prefer to live within the terminal, papis is a great choice for me. When I write, I tend to write the article as I read papers. I have never been a good note taker (although I am trying out some zettelkasten neovim plugins like vim-wiki), and so being able to quickly add articles to my library as I write is a great feature for me.\nI am using the form functionality in the neovim API to catch a DOI or other link and escape to a shell process for creating the record in the papis database. This is essentially a wrapper around the papis CLI that allows for interaction with the CLI from within neovim using neovim commands. I am hoping to get this functionality merged and have test coverage over the next couple of months.\nBuilding a small Flask App for Zettelkasten\nI have been working on zktn, a small flask app that creates a graph view of any directory containing one or more markdown documents. It uses the pyviz library and networkx to create a web server where the user can view and interact with nodes (notes) and edges of the graph. I have yet to test it at a very large scale, as I do not have that many notes. There are certainly optimizations and features that can be added to the tool, but now it is functional by just using python ./ztkn/src.py /path/to/notes.\nI use neovim to take notes, write academic articles, and do data science. My entire workflow is in neovim. I have tried a lot of zettelkasten neovim plugins, but I have always found that the way I find most ergonomic for me is to simply touch note.md and start writing. Luckily, LazyVim’s “lang.markdown” plugin helps in making creating the actual links between documents ergonomic, allowing me to simply use the note syntax and then use ztkn to build a graph.\nAccelerating Digital Humanities Research with CUDA on Northwestern’s Supercomputer\nMy home university, Northwestern, has an amazing supercomputer resource that I am lucky enough to be able to access for free as faculty. However, as upgrading enterprise infrastructure is a pain in the ass, we are running out of date versions of CUDA and libc. I am currently using BERTopic to run topic modelling and similarity analysis on hundreds of thousands of academic articles, newspapers, visual arts, and novels to understand how the language of the anthropocene propogates through different media types and within different people who use the same medium of communication.\nUsing BERTopic with CUDA was quite a pain. Actually, more specifically, using conda on a supercomputer is a pain. Depending on the order that you would install packages, different versions would be installed and some modules of PyTorch would outright not be found. Luckily, on Northwestern’s HPC, we can use Torch 2.0 to be compatible with the relatively outdated glib version that Quest is running.\nAfter topic modelling, I am using networkx to analyze inter-topic interactions and influence, for example, answering the question “Do newspapers about climate change influence scientists to study the climate?” Or vice versa. BERTopic generated thousands of topics with the very large corpus I fed it, and so creating a network of all of these nodes and calculating the cosine similarity between these nodes took hours of embedding documents, creating a graph, and then calculating the cosine similarity between nodes. Using the RAPIDSAI library, specifically the cuGraph module, I was able to speed up the networkx backend by several times, allowing me to decrease our time-to-insight, debug, and find new results or ideas faster.\nSome other thoughts\nI have been wanting to create more resources for neovim. Many of my friends love VSCode, for good reason too. A slick looking UI, great remote development features, and a huge ecosystem of plugins justifies its’ market dominance in programmers. The tools above, especially new functionality papis.nvim and the ztkn application, will hopefully ease the transition into neovim, and allow for easy integration with other tools.\nBe on the lookout on my next post to talk about how I am using LLMs to generate metadata to decrease author burden and increase the publishing efficiency of libraries by using GPT-3.5 to convert plaintext citations into a biblatex format."},"holocene":{"title":"The Holocene","links":[],"tags":[],"content":"Holocene meaning “Recent Whole”\n\nPost-glacial geological epoch of past 10-12 thousand years. 1\n\nFootnotes\n\n\nQuoted from the “Anthropocene” by Paul Crutzen and Eugene F. Stoermer LINK ↩\n\n\n"},"index":{"title":"Welcome to my KyberGarden","links":["devlog-1"],"tags":[],"content":"I am Aerith Netzer, the nominal Digital Publishing and Repository Librarian at Northwestern. This is part notebook, blog, and portfolio for my works in my professional and personal knowledge acquisition.\ndevlog-1.md"}}